In [4]:
import pandas as pd

In [5]:
data = {
"Employee_ID": [101, 102, 103, 104],
"Name": ["Amit", "Bhavna", "Chetan", "Divya"],
"Department": ["HR", "Finance", "IT", "Marketing"],
"Salary": [50000, 60000, 55000, 52000],
"Joining_Date": ["2022-01-10", "2021-03-15", "2020-07-01", "2023-02-20"]
}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

   Employee_ID    Name Department  Salary Joining_Date
0          101    Amit         HR   50000   2022-01-10
1          102  Bhavna    Finance   60000   2021-03-15
2          103  Chetan         IT   55000   2020-07-01
3          104   Divya  Marketing   52000   2023-02-20

In [9]:
from sqlalchemy import create_engine
mysql_conn = create_engine("mysql+pymysql://root:root@localhost:3306/sowjidb")

In [10]:
df.to_sql("employee",mysql_conn,index=False)

4

In [11]:
pd.read_sql("""select * from employee where Department in ('HR','IT')""",mysql_conn)

   Employee_ID    Name Department  Salary Joining_Date
0          101    Amit         HR   50000   2022-01-10
1          103  Chetan         IT   55000   2020-07-01

In [12]:
%pip install oracledb sqlalchemy

Requirement already satisfied: oracledb in c:\users\syama\appdata\local\programs\python\python313\lib\site-packages (3.4.0)
Requirement already satisfied: sqlalchemy in c:\users\syama\appdata\local\programs\python\python313\lib\site-packages (2.0.44)
Requirement already satisfied: cryptography>=3.2.1 in c:\users\syama\appdata\local\programs\python\python313\lib\site-packages (from oracledb) (46.0.3)
Requirement already satisfied: typing_extensions>=4.14.0 in c:\users\syama\appdata\local\programs\python\python313\lib\site-packages (from oracledb) (4.15.0)
Requirement already satisfied: greenlet>=1 in c:\users\syama\appdata\local\programs\python\python313\lib\site-packages (from sqlalchemy) (3.2.4)
Requirement already satisfied: cffi>=2.0.0 in c:\users\syama\appdata\local\programs\python\python313\lib\site-packages (from cryptography>=3.2.1->oracledb) (2.0.0)
Requirement already satisfied: pycparser in c:\users\syama\appdata\local\programs\python\python313\lib\site-packages (from cffi>=2.0.0->cryptography>=3.2.1->oracledb) (2.23)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [13]:
from sqlalchemy import create_engine
oracle_conn = create_engine("oracle+oracledb://system:qazwsxEDC!23@localhost:1521/?service_name=orclpdb.lan")

In [14]:
df.to_sql("employee",oracle_conn,index=False)

-1

In [15]:
pd.read_sql("""select * from employee""",oracle_conn)

   Employee_ID    Name Department  Salary Joining_Date
0          101    Amit         HR   50000   2022-01-10
1          102  Bhavna    Finance   60000   2021-03-15
2          103  Chetan         IT   55000   2020-07-01
3          104   Divya  Marketing   52000   2023-02-20